# Задача «Длина слова».
a = "Hello everyone!"
print(len(a))

# Задача «Суммы и разности».
first = 4
second = 7
summa = first + second
diff = first - second
print(summa, diff)

# Задача «Среднее арифметическое».
first = 6
second = 13
third = -3
mean = ((first + second + third) / 3)
print(mean)

# Задача «Простые строчки».
first_string = "Понедельник"
second_string = "Вторник"
print(first_string, second_string, sep = ", ")

# Задача «Сложная формула».
a = -5
b = 3
c = 14
f = (a * b) + (a * c)
print(f ** 3 / 2)